{
  "hidden_size": 768,
  "num_hidden_layers": 12,
  "num_attn_heads": 12,
  "num_lact_heads": 4,
  "inter_multi": 1,
  "qkv_bias": false,
  "attn_qk_norm": false,
  "lact_chunk_size": 4096,
  "use_muon": true,
  "lr_dim": 1,
  "qkv_silu": true,
  "window_size": 4096,
  "lr_parameterization": "mamba",
  "learnable_ttt_scale": true,
  "ttt_prenorm": false,
  "ttt_nope": false,
  "rope_theta": 1000000,
  "max_position_embeddings": 16384,
  "hidden_ratio": 4,
  "intermediate_size": null,
  "hidden_act": "swish",
  "initializer_range": 0.02,
  "elementwise_affine": true,
  "norm_eps": 1e-06,
  "use_cache": true,
  "fuse_norm": true,
  "last_layer_fuse_norm": true,
  "fuse_swiglu": true,
  "fuse_cross_entropy": true,
  "vocab_size": 29,
  "use_momentum": true,
  "ttt_loss_type": "dot_product",
  "w0_w2_low_rank": 32,
  "fw_init_gain": 0.5,
  "return_dict": true,
  "output_hidden_states": false,
  "torchscript": false,
  "dtype": null,
  "pruned_heads": {},
  "tie_word_embeddings": false,
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "is_decoder": false,
  "cross_attention_hidden_size": null,
  "add_cross_attention": false,
  "tie_encoder_decoder": false,
  "architectures": null,
  "finetuning_task": null,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "task_specific_params": null,
  "problem_type": null,
  "tokenizer_class": null,
  "prefix": null,
  "bos_token_id": 1,
  "pad_token_id": 0,
  "eos_token_id": 2,
  "sep_token_id": null,
  "decoder_start_token_id": null,
  "max_length": 20,
  "min_length": 0,
  "do_sample": false,
  "early_stopping": false,
  "num_beams": 1,
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 1.0,
  "typical_p": 1.0,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "no_repeat_ngram_size": 0,
  "encoder_no_repeat_ngram_size": 0,
  "bad_words_ids": null,
  "num_return_sequences": 1,
  "output_scores": false,
  "return_dict_in_generate": false,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": false,
  "exponential_decay_length_penalty": null,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "_name_or_path": "",
  "transformers_version": "4.57.0",
  "model_type": "lact_asr",
  "use_spec_augment": true,
  "tf_legacy_loss": false,
  "use_bfloat16": false,
  "audio_feature_dim": 80,
  "sample_rate": 16000,
  "hop_length": 160,
  "win_length": 400,
  "n_mels": 80,
  "n_fft": 512,
  "ctc_vocab_size": 29,
  "use_ctc": true,
  "use_attention": false,
  "audio_encoder_layers": 2,
  "audio_encoder_dropout": 0.1,
  "ctc_blank_id": 0,
  "output_attentions": false
}